#version: 0.2
t h
h e
t i
i o
o n
e r
a n
i n
e n
n t
r e
o r
s t
a r
l y
c o
m p
u t
a t
i v
e s
d e
c t
g e
n e
l l
w a
b l
f o
w o
o r
r d
m o
d e
l s
b p
p e
e n
g i
t r
C #
.  (dot-space guard; harmless)
,  (comma-space guard; harmless)
' s
u n
k n
o w
n  (n-single)
w i
i th
th e
e s
s e
re s
s u
u l
l t
e d
de r
er s
s .
I s
is  (merge)
ti o
tio n
na l
al l
ll y
pr o
o m
pt s
wh i
hi te
te sp
sp ac
ac e
en co
co de
e c
ex a
a mp
mp le
le s
tr a
ra ns
ns f
fo rm
rm er
er s
la ng
ng ua
ua ge
ge  (e-space)
mo de
de l
in g
ta sk
sk s
nu m
m be
be r
r s
em oj
oj i
i 🚀
to k
ok en
en s
en t
co rp
rp us
us  (s-space)
an d
da ta
ta  (a-space)
po si
si ti
ti on
on al
al  (l-space)
en co d
co di
di ng
ca se
se s
re al
al is
is ti
ti c
pu nc
nc tu
tu at
at io
io n
lo ng
ng  (g-space)
sh or
or t
qu ot
ot e
e s
" "  (quotes pair)
( )  (parens pair)
[ ]  (brackets pair)
