{
  "<|bos|>": 0,
  "<|eos|>": 1,
  "<|pad|>": 2,

  " ": 3,
  "a": 4,
  "b": 5,
  "c": 6,
  "d": 7,
  "e": 8,
  "f": 9,
  "g": 10,
  "h": 11,
  "i": 12,
  "j": 13,
  "k": 14,
  "l": 15,
  "m": 16,
  "n": 17,
  "o": 18,
  "p": 19,
  "q": 20,
  "r": 21,
  "s": 22,
  "t": 23,
  "u": 24,
  "v": 25,
  "w": 26,
  "x": 27,
  "y": 28,
  "z": 29,
  "A": 30,
  "B": 31,
  "C": 32,
  "D": 33,
  "E": 34,
  "F": 35,
  "G": 36,
  "H": 37,
  "I": 38,
  "J": 39,
  "K": 40,
  "L": 41,
  "M": 42,
  "N": 43,
  "O": 44,
  "P": 45,
  "Q": 46,
  "R": 47,
  "S": 48,
  "T": 49,
  "U": 50,
  "V": 51,
  "W": 52,
  "X": 53,
  "Y": 54,
  "Z": 55,

  "0": 56,
  "1": 57,
  "2": 58,
  "3": 59,
  "4": 60,
  "5": 61,
  "6": 62,
  "7": 63,
  "8": 64,
  "9": 65,

  ".": 66,
  ",": 67,
  "!": 68,
  "?": 69,
  ":": 70,
  ";": 71,
  "'": 72,
  "\"": 73,
  "(": 74,
  ")": 75,
  "[": 76,
  "]": 77,
  "-": 78,
  "_": 79,
  "/": 80,
  "+": 81,
  "=": 82,
  "#": 83,

  "th": 100,
  "he": 101,
  "in": 102,
  "er": 103,
  "an": 104,
  "re": 105,
  "on": 106,
  "at": 107,
  "en": 108,
  "nd": 109,
  "ti": 110,
  "te": 111,
  "st": 112,
  "ar": 113,
  "or": 114,
  "al": 115,
  "ly": 116,
  "co": 117,
  "de": 118,
  "ed": 119,
  "to": 120,
  "is": 121,
  "it": 122,
  "el": 123,
  "ro": 124,
  "ra": 125,

  "tion": 140,
  "ing": 141,
  "model": 142,
  "token": 143,
  "tokens": 144,
  "encode": 145,
  "decode": 146,
  "prompt": 147,
  "corpus": 148,
  "vocab": 149,
  "merges": 150,
  "whitespace": 151,
  "unicode": 152,
  "emoji": 153,
  "🚀": 154,
  "transformer": 155,
  "attention": 156,
  "position": 157,
  "language": 158,
  "models": 159,
  "byte": 160,
  "pair": 161,
  "encoding": 162,

  "BPE": 170,
  "BPEngine": 171,
  "C": 172,
  "#": 173,
  "C#": 174,

  "Hello": 200,
  "world": 201,
  "This": 202,
  "project": 203,
  "provides": 204,
  "pure": 205,
  "written": 206,
  "in": 207,
  "analysis": 208,
  "statistics": 209,
  "top": 210,
  "bigrams": 211,
  "trim": 212,
  "budget": 213,
  "snippet": 214,

  "short": 220,
  "long": 221,
  "realistic": 222,
  "punctuation": 223,
  "numbers": 224,
  "whitespace": 225,
  "newline": 226,
  "tab": 227,

  "and": 240,
  "the": 241,
  "of": 242,
  "for": 243,
  "with": 244,
  "by": 245,
  "from": 246,
  "to": 247,
  "as": 248,
  "that": 249,
  "are": 250,
  "be": 251,
  "can": 252,
  "use": 253,
  "used": 254,
  "useful": 255,
  "demo": 256,

  "(": 300,
  ")": 301,
  "[": 302,
  "]": 303,
  "\"": 304,
  "'s": 305,

  "engine": 320,
  "train": 321,
  "trainer": 322,
  "analyze": 323,
  "analyzer": 324,
  "generate": 325,
  "ngram": 326,
  "tiny": 327,
  "Transformer": 328,
  "playground": 329,

  "front": 340,
  "door": 341,
  "language": 342,
  "matters": 343,
  "production": 344,
  "LLMs": 345,

  "space": 360,
  "mapping": 361,
  "byte-unicode": 362,
  "merge": 363,
  "rank": 364,

  "examples": 380,
  "dataset": 381,
  "lines": 382,
  "file": 383,
  "paths": 384,
  "artifacts": 385,

  "—": 390
}
