#version: 0.2
# GPT-2 BPE merges file (subset for testing)
t h
th e
i n
er </w>
a n
re </w>
o n
e r
ed </w>
s t
en t
at ion
ou r
o f
t ion
in g
he r
, </w>
. </w>
y </w>
m ent
c om
p er
d </w>
s </w>
ly </w>
de </w>
al </w>
ar e
c tion
u n
s e
a t
t he
ic al
f or
h at
is </w>
e n
l y
n t
it y
